#### BuiltInFailures.PartMakerMethodForWallFailures Members

---

|  |
| --- |
| BuiltInFailures PartMakerMethodForWallFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures PartMakerMethodForWallFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CouldNotAdjustWallPartsAtJoin | Failed to extend or trim some layer at an end join |
| Public property Static member | CouldNotCreateWallPart | Failed to create basic layer geometry. Probably a failure either to create the cutter or to intersect the cutter with the wall geometry. |
| Public property Static member | CouldNotCreateWallPartDueToWallJoin | Failed to create basic layer geometry due to an excessively short edge created by wall join. |

# See Also

BuiltInFailures PartMakerMethodForWallFailures Class

Autodesk.Revit.DB Namespace